{
  "landing.title": "یادگیری ریجکس به صورت گام به گام ، از صفر تا صد.",
  "landing.description": "یادگیری ریجکس از چیزی که فکر میکنید ، ساده تر است. میتوانید از این وب سایت برای `یادگیری`، `تمرین`، `تست` و `اشتراک گذاری` استفاده کنید.",
  "landing.imageAltText": "تصویر مردی که پاهایش را روی میز گذاشته است.",

  "section.learn.title": "آموزش",
  "section.learn.content": "کلمه Regular Expressions که به اختصار Regex یا Regexp نامیده می شود، رشته ای از کاراکترها هستند که در چارچوب قوانین نحوی Regex ایجاد شده اند. شما به راحتی می توانید داده های خود را با Regex مدیریت کنید که از دستوراتی مانند یافتن، تطبیق و ویرایش استفاده می کند. Regex را می توان در زبان های برنامه نویسی مانند Python، SQL، JavaScript، R، Google Analytics، Google Data Studio و در طول فرآیند کدنویسی استفاده کرد. هم اکنون regex را با مثال ها و آموزش های RegexLearn به صورت آنلاین بیاموزید.",
  "section.learn.imageAltText": "تصویر کوه با پرچمی بر قله آن.",

  "section.cheatsheet.button": "همین الان بررسی کنید",
  "section.cheatsheet.title": "برگه تقلب",
  "section.cheatsheet.content": "با برگه تقلب ریجکس میتونید همه آنچه نیاز دارید را به طور همزمان بررسی کنید. تمام الگوها و نمادها در برگه تقلب وجود دارند.",
  "section.cheatsheet.imageAltText": "تصویر مردی که صفحات را با دوربین دوچشمی مشاهده میکند.",

  "section.playground.title": "زمین تمرین",
  "section.playground.content": "اگر میخواهید یک ریجکس بسازید و آن را آزمایش کنید، میتوانید از طریق زمین بازی این کار را انجام دهید و با دیگران به اشتراک بگذارید.",
  "section.playground.imageAltText": "تصویر گربه ایی در حال انداختن لیوان پر.",

  "section.practice.title": "تمرین",
  "section.practice.content": "اگر بخش یادگیری را تکمیل کرده اید، زمان تمرین کردن رسیده! در بخش تمرین میتوانید دانش خود را ارتقا دهید. به زودی در دسترس قرار خواهد گرفت.",
  "section.practice.imageAltText": "تصویر زنی که از یک کتاب یادداشت میکند.",

  "section.opensource.title": "منبع باز",
  "section.opensource.content": "این وب سایت یک پروژه منبع باز است که از مشارکت های داخل جامعه استقبال میکند و همچنین استفاده از آن رایگان است. کار بر روی این پروژه به شما امکان میدهد مهارت های خود را تقویت کنید. شما میتوانید در زیر مشارکت و حمایت کنید.",
  "section.opensource.imageAltText": "تصویری از یک زن، یک مرد و یک گربه که قطعات پازل را کنار هم میچینند."
}
