{
  "landing.title": "Sıfırdan ileri seviyeye, adım adım Regex öğren.",
  "landing.description": "Regex öğrenmek düşündüğünüzden daha kolay. Regex'i kolayca `öğrenmek`, `pratik yapmak`, `test etmek` ve `paylaşmak` için bu aracı kullanabilirsiniz.",
  "landing.imageAltText": "Bacakları masanın üzerinde olan rahat bir adamın illüstrasyonu.",

  "section.learn.title": "Öğren",
  "section.learn.content": "`Regular Expressions` (Düzenli İfadeler)'in kısaltması olan Regex veya Regexp söz dizimi (syntax) kuralları çerçevesinde oluşturulan bir karakter dizisidir. Bulma, eşleştirme, düzenleme gibi komutları uygulayabileceğiniz Regex ile hızlı ve pratik bir şekilde verilerinizi yönetebilirsiniz. Python, SQL, JavaScript, R gibi programlama dillerinde, Google Analytics, Google Data Studio ve kod işlemlerinde kullanabileceğiniz Regex'i `RegexLearn` üzerinden örneklerle online bir şekilde hemen öğrenin.",
  "section.learn.imageAltText": "Zirvesinde bayrak olan bir dağın illüstrasyonu.",

  "section.cheatsheet.button": "Şimdi İncele",
  "section.cheatsheet.title": "Cheatsheet",
  "section.cheatsheet.content": "`RegexLearn Cheatsheet` ile ihtiyacınız olan kullanımları toplu bir şekilde görebilir, pratik bir şekilde hemen tek bir sayfadan kontrol edebilirsiniz. Tüm Regex pattern ve sembollerini Regex cheatsheet ile keşfedin.",
  "section.cheatsheet.imageAltText": "Dürbünle sayfaları inceleyen bir adamın illüstrasyonu.",

  "section.playground.title": "Playground",
  "section.playground.content": "Kolayca `Regex` ifadelerinizi oluşturup test edebileceğiniz `Playground` ile tek tıkla oluşturduğunuz ifadeleri paylaşıp takımınızla ortak bir şekilde çalışabilirsiniz.",
  "section.playground.imageAltText": "Dolu bir bardağı düşürmek üzere olan bir kedinin illüstrasyonu.",

  "section.practice.title": "Pratik",
  "section.practice.content": "Öğrenme bölümünü tamamladıysanız şimdi sıra pratikte! Her seviyeye uygun olarak hazırlanmış pratik bölümü ile Regex bilginizi pekiştirebilir ve kendinizi geliştirebilirsiniz. Yakında yayında.",
  "section.practice.imageAltText": "Bir kitaptan not alan bir kadının illüstrasyonu.",

  "section.opensource.title": "Açık Kaynak",
  "section.opensource.content": "Açık kaynaklı bir proje olan Regex Learn tamamen kullanımı ücretsiz bir araçtır. Yeteneklerinizi geliştirmek ve projeye katkı sağlamak için hemen tıklayın.",
  "section.opensource.imageAltText": "Yapboz parçalarını bir araya getiren bir kadın, bir erkek ve bir kedinin illüstrasyonu."

}
