{
  "landing.title": "Изучите RegEx шаг за шагом, от нуля до продвинутого уровня.",
  "landing.description": "Изучить RegEx проще, чем вы думаете. Вы можете использовать этот инструмент, чтобы легко `изучить`, `попрактиковаться`, `протестировать` и `поделиться` RegEx с другими пользователями.",

  "section.learn.title": "Изучайте",
  "section.learn.content": "`Регулярные выражения`, сокращённо RegEx или RegExp, представляют собой строку символов, созданную в рамках правил синтаксиса RegEx. Вы можете легко управлять своими данными с помощью RegEx, который использует такие команды как: поиск, поиск сходства и редактирование. RegEx можно использовать в языках программирования, таких как Python, SQL, Javascript, R, Google Analytics, Google Data Studio, а также на протяжении всего процесса программирования. Изучите RegEx онлайн с примерами и учебными пособиями на RegexLearn сейчас.",

  "section.cheatsheet.button": "Проверить",
  "section.cheatsheet.title": "Cheatsheet",
  "section.cheatsheet.content": "С помощью `RegexLearn Cheatsheet` вы можете сразу увидеть все необходимые вам примеры использования и проверить их работу онлайн не покидая сайт. Изучите все шаблоны и символы RegEx с помощью RegEx Cheatsheet.",

  "section.playground.title": "Playground",
  "section.playground.content": "Вы можете легко создать и протестировать свой шаблон RegEx с помощью Playground. Как тестировщик RegEx, вы можете проверять и делиться своими вариантами RegEx с другими пользователями для совместной работы. Скоро.",

  "section.practice.title": "Практика",
  "section.practice.content": "Если вы завершили учебную часть, это время ПРАКТИКОВАТЬ! В разделе практики вы можете проверить свои знания и практиковаться в RegEx с помощью учебных пособий RegEx в зависимости от вашего уровня. Скоро.",

  "section.opensource.title": "Open Source",
  "section.opensource.content": "Regex Learn - это проект с открытым исходным кодом, который приветствует вклад сообщества и является бесплатным для использования. Работа над этим проектом позволяет вам оттачивать свои навыки, учиться и сотрудничать с другими участниками. Здесь вы можете внести свой вклад и поддержать проект."
}
