{
  "landing.title": "Вивчіть Regex крок за кроком, від нуля до просунутого рівня.",
  "landing.description": "Вивчити Regex простіше, ніж ви думаєте. Ви можете використовувати цей інструмент, щоб легко `вивчити`, `попрактикуватися`, `протестувати` і `поділитися` Regex з іншими користувачами.",
  "landing.imageAltText": "Ілюстрація розслабленої людини, що поклала ноги на стіл.",

  "section.learn.title": "Вивчайте",
  "section.learn.content": "`Регулярні вирази`, скорочено Regex або Regexp, є рядком символів, створених у рамках правил синтаксису Regex. Ви можете легко керувати своїми даними за допомогою Regex, який використовує такі команди як: пошук, пошук подібності та редагування. Regex можна використовувати в мовах програмування, таких як Python, SQL, JavaScript, R, Google Analytics, Google Data Studio, а також протягом усього процесу програмування. Вивчите Regex онлайн з прикладами та навчальними посібниками на RegexLearn зараз.",
  "section.learn.imageAltText": "Ілюстрація гори з прапором на вершині.",

  "section.cheatsheet.button": "Перевірити",
  "section.cheatsheet.title": "Cheatsheet",
  "section.cheatsheet.content": "За допомогою `RegexLearn Cheatsheet` ви можете одразу побачити всі необхідні вам приклади використання та перевірити їх роботу онлайн не залишаючи сайт. Вивчіть усі шаблони та символи Regex за допомогою Regex Cheatsheet.",
  "section.cheatsheet.imageAltText": "Ілюстрація людини, яка переглядає сторінки в бінокль.",

  "section.playground.title": "Playground",
  "section.playground.content": "Ви можете легко створити та протестувати свій шаблон Regex за допомогою Playground. Як тестувальник Regex, ви можете перевіряти та ділитися своїми варіантами Regex з іншими користувачами для спільної праці.",
  "section.playground.imageAltText": "Ілюстрація кота, який збирається упустити повну склянку.",

  "section.practice.title": "Практика",
  "section.practice.content": "Якщо ви завершили навчальну частину, то це час ПРАКТИКУВАТИ! У розділі практики ви можете перевірити свої знання та попрактикуватись у Regex за допомогою навчальних посібників Regex залежно від вашого рівня. Незабаром.",
  "section.practice.imageAltText": "Ілюстрація жінки, яка робить нотатки в книзі.",

  "section.opensource.title": "Open Source",
  "section.opensource.content": "Regex Learn - це проект з відкритим вихідним кодом, який вітає внесок спільноти та є безкоштовним для використання. Робота над цим проектом дозволяє вам відточувати свої навички, навчатися та співпрацювати з іншими учасниками. Тут ви можете зробити свій внесок і підтримати проект.",
  "section.opensource.imageAltText": "Ілюстрація жінки, чоловіка і кішки, що збирають шматочки головоломки."
}
