{
  "landing.title": "تعلم التعبيرات النمطية خطوة بخطوة، من الصفر إلى المتقدم.",
  "landing.description": "تعلم التعبيرات النمطية أسهل مما تعتقد. يمكنك استخدام هذه الأداة بسهولة `للتعلم`، `الممارسة`، `الاختبار` و`المشاركة` للتعبيرات النمطية.",
  "landing.imageAltText": "رسم توضيحي لرجل مسترخٍ يضع رجليه على الطاولة.",

  "section.learn.title": "تعلم",
  "section.learn.content": "`التعبيرات النمطية`، المختصرة باسم Regex أو Regexp، هي سلسلة من الأحرف التي تم إنشاؤها ضمن إطار قواعد بناء الجملة للتعبيرات النمطية. يمكنك إدارة بياناتك بسهولة باستخدام التعبيرات النمطية، التي تستخدم أوامر مثل البحث والتطابق والتحرير. يمكن استخدام التعبيرات النمطية في لغات البرمجة مثل بايثون، SQL، جافاسكريبت، R، Google Analytics، Google Data Studio، وعبر عملية البرمجة. تعلم التعبيرات النمطية عبر الإنترنت مع الأمثلة والدروس على RegexLearn الآن.",
  "section.learn.imageAltText": "رسم توضيحي لجبل مع علم على قمته.",

  "section.cheatsheet.button": "مراجعة الآن",
  "section.cheatsheet.title": "ورقة معلومات مرجعية",
  "section.cheatsheet.content": "مع `ورقة معلومات مرجعية لـ RegexLearn`، يمكنك رؤية جميع الاستخدامات التي تحتاجها مرة واحدة والتحقق منها مباشرة من صفحة واحدة. استكشف جميع أنماط ورموز التعبيرات النمطية مع ورقة المعلومات المرجعية.",
  "section.cheatsheet.imageAltText": "رسم توضيحي لرجل يشاهد الصفحات من خلال مناظير.",

  "section.playground.title": "ساحة اللعب",
  "section.playground.content": "إذا كنت تريد إنشاء تعبير نمطي، يمكنك بناء واختبار نمط التعبير النمطي الخاص بك بسهولة عبر ساحة اللعب. كاختبار للتعبيرات النمطية، يمكنك التحقق من صحتها ومشاركتها مع الآخرين للعمل التعاوني.",
  "section.playground.imageAltText": "رسم توضيحي لقطة على وشك إسقاط كوب ممتلئ.",

  "section.practice.title": "التدريب",
  "section.practice.content": "إذا أكملت جزء التعلم، فقد حان الوقت للتدريب! في قسم التدريب، يمكنك اختبار معرفتك بالتعبيرات النمطية والتدرب مع دروس التعبيرات النمطية بناءً على مستواك. قريبًا.",
  "section.practice.imageAltText": "رسم توضيحي لامرأة تدون ملاحظات من كتاب.",

  "section.opensource.title": "المصدر المفتوح",
  "section.opensource.content": "تعلم التعبيرات النمطية هو مشروع مفتوح المصدر يرحب بمساهمات المجتمع ومجاني للاستخدام. العمل على هذا المشروع يتيح لك تحسين مهاراتك والدراسة والتعاون. يمكنك المساهمة والدعم هنا.",
  "section.opensource.imageAltText": "رسم توضيحي لامرأة ورجل وقطة يضعون قطع اللغز معًا."
}
