{
  "landing.title": "ისწავლეთ Regex-ი ეტაპობრივად, ნულიდან მაღალ დონეზე.",
  "landing.description": "Regex-ის შესწავლა იმაზე მარტივია, ვიდრე წარმოგიდგენიათ. შეგიძლიათ გამოიყენოთ წინამდებარე მასალა, რათა `ისწავლოთ`, `ივარჯიშოთ`, `გამოსცადოთ` და `გააზიაროთ` Regex-ი მარტივად.",
  "landing.imageAltText": "ილუსტრაცია მოდუნებული კაცისა, რომელსაც ფეხები მაგიდაზე შემოუწყვია.",

  "section.learn.title": "სწავლა",
  "section.learn.content": "`რეგულარული გამოსახულება`, შემოკლებით Regex ან Regexp, არის სიმბოლოებისგან შემდგარი სტრიქონი, რომელიც შექმნილია Regex-ის სინტაქსის წესებზე დაყრდნობით. Regex-ით, — რომელიც იყენებს ბრძანებებს, როგორებიცაა ძიება, მსგავსება და რედაქტირება, — შეგიძლიათ მარტივად მართოთ თქვენი მონაცემები. Regex-ი შეიძლება გამოყენებულ იქნეს პროგრამირების ისეთ ენებში, როგორებიცაა Python, SQL, JavaScript, R, Google Analytics, Google Data Studio და სხვა. ისწავლეთ Regex-ი ონლაინ ახლავე, RegexLearn-ზე არსებული სასწავლო მასალებისა და მაგალითების გამოყენებით.",
  "section.learn.imageAltText": "ილუსტრაცია მთისა, რომლის მწვერვალზეც დროშა არის აღმართული.",

  "section.cheatsheet.button": "გადახედვა",
  "section.cheatsheet.title": "ზოგადი განმარტებები",
  "section.cheatsheet.content": "`RegexLearn-ის ზოგადი განმარტებების` გამოყენებით შეგიძლიათ ერთბაშად იხილოთ Regex-ის მოხმარების ყველა მაგალითი და გამოსცადოთ ისინი უშუალოდ ამ ერთი გვერდიდან. შეისწავლეთ ყველა Regex-ნუმიში და სიმბოლო ზოგადი განმარტებების გამოყენებით.",
  "section.cheatsheet.imageAltText": "ილუსტრაცია კაცისა, რომელიც გვერდებს ბინოკლით აკვირდება.",

  "section.playground.title": "სავარჯიშო სივრცე",
  "section.playground.content": "თუ გსურთ, დააგენერიროთ Regex-ი, ამაში სავარჯიშო სივრცე დაგეხმარებათ, სადაც შეგიძლიათ ძალიან მარტივად ააგოთ და გამოსცადოთ Regex-ნიმუშები. თქვენ, როგორც Regex-ტესტერს, შეგიძლიათ შეამოწმოთ ამა თუ იმ Regex-ის ვალიდურობა და გაუზიაროთ იგი სხვებს კოლაბორაციული მუშაობისთვის.",
  "section.playground.imageAltText": "ილუსტრაცია კატისა, რომელიც სადაცაა პირთამდე სავსე ჭურჭელს გადმოაგდებს.",

  "section.practice.title": "პრაქტიკა",
  "section.practice.content": "როდესაც სასწავლო მასალის ნაწილს ამოწურავთ, დგება დრო ცოდნის პრაქტიკაში გამოყენებისა! პრაქტიკული მუშაობის განყოფილებაში შეგიძლიათ შეამოწმოთ თქვენი ცოდნა Regex-ის კონტექსტში და ივარჯიშოთ სათანადო მასალებზე დაყრდნობით, თქვენი ცოდნის შესაბამისად. ეს ფუნქცია მალე დაემატება.",
  "section.practice.imageAltText": "ილუსტრაცია ქალბატონისა, რომელიც ახორციელებს შენიშვნების ამოკრებას წიგნიდან.",

  "section.opensource.title": "ღია რესურსი",
  "section.opensource.content": "Regex Learn — ეს არის ღია პროექტი, რომელიც მიესალმება ნებისმიერი მსურველის მიერ მის განვითარებაში შეტანილ ნებისმიერი სახის წვლილს  და არის სრულიად უფასო. ამ პროექტზე მუშაობა საშუალებას მოგცემთ გაიუმჯობესოთ უნარები, ისწავლოთ და ითანამშრომლოთ სხვებთან. შეგიძლიათ მხარში ამოუდგეთ პროექტს და ხელი შეუწყოთ მის განვითარებას.",
  "section.opensource.imageAltText": "ილუსტრაცია ქალბატონისა, ბატონისა და კატისა, რომლებიც თავსატეხის ფრაგმენტებს ერთად უყრიან თავს."
}
