{
  "landing.title": "ისწავლეთ Regex-ი ნაბიჯ-ნაბიჯ, ნულიდან მაღალ დონემდე.",
  "landing.description": "Regex-ის შესწავლა იმაზე მარტივია, ვიდრე წარმოგიდგენიათ. შეგიძლიათ გამოიყენოთ წინამდებარე ინსტრუმენტი, რათა `ისწავლოთ`, `ივარჯიშოთ`, `გამოსცადოთ` და `გააზიაროთ` Regex-ი მარტივად.",
  "landing.imageAltText": "ილუსტრაცია მოდუნებული კაცისა, რომელსაც ფეხები მაგიდაზე შემოუწყვია.",

  "section.learn.title": "სწავლა",
  "section.learn.content": "`რეგულარული გამოსახულება`, შემოკლებით Regex ან Regexp, არის სიმბოლოებისგან შემდგარი სტრიქონი, რომელიც შექმნილია Regex-ის სინტაქსის წესებზე დაყრდნობით. Regex-ით, რომელიც იყენებს ბრძანებებს, როგორიცაა ძიება, მსგავსება და რედაქტირება, შეგიძლიათ მარტივად მართოთ თქვენი მონაცემები. Regex-ი შეიძლება გამოყენებულ იქნეს პროგრამირების ენებში, როგორიცაა Python, SQL, JavaScript, R, Google Analytics, Google Data Studio და უშუალოდ კოდირების პროცესში. ისწავლეთ Regex-ი ონლაინ ახლავე, მაგალითებითა და გაკვეთილებით, RegexLearn-ზე.",
  "section.learn.imageAltText": "ილუსტრაცია მთისა, რომლის მწვერვალზეც დროშა არის აღმართული.",

  "section.cheatsheet.button": "გადახედვა",
  "section.cheatsheet.title": "შპარგალკა",
  "section.cheatsheet.content": "`RegexLearn შპარგალკის` დახმარებით შეგიძლიათ ერთბაშად იხილოთ Regex-ის მოხმარების ყველა მაგალითი და გამოსცადოთ ისინი უშუალოდ ერთი გვერდიდან. გამოიკვლიეთ Regex-ის ყველა ნიმუში და სიმბოლო Regex-შპარგალკის გამოყენებით.",
  "section.cheatsheet.imageAltText": "ილუსტრაცია კაცისა, რომელიც გვერდებს ბინოკლით აკვირდება.",

  "section.playground.title": "სათამაშო მოედანი",
  "section.playground.content": "თუ გსურთ, დააგენერიროთ Regex-ი, ამაში სათამაშო მოედანი (Playground) დაგეხმარებათ, სადაც შეგიძლიათ ძალიან მარტივად ააგოთ და გამოსცადოთ Regex-ნიმუშები. თქვენ, როგორც Regex-ის ტესტერს, შეგიძლიათ დაადასტუროთ ამა თუ იმ Regex-ის სისწორე და გაუზიაროთ იგი სხვებს ერთობლივი მუშაობის მიზნით.",
  "section.playground.imageAltText": "ილუსტრაცია კატისა, რომელიც სადაცაა პირთამდე სავსე ჭურჭელს გადმოაგდებს.",

  "section.practice.title": "პრაქტიკა",
  "section.practice.content": "როდესაც სწავლის ნაწილს ამოწურავ, დგება დრო ცოდნის პრაქტიკაში გამოყენებისა! პრაქტიკის განყოფილებაში შეგიძლიათ შეამოწმოთ თქვენი ცოდნა Regex-თან დაკავშირებით და ივარჯიშოთ სათანადო გაკვეთილებზე დაყრდნობით თქვენი ცოდნის შესაბამისად. მალე.",
  "section.practice.imageAltText": "ილუსტრაცია ქალბატონისა, რომელიც ახორციელებს შენიშვნების ამოკრებას წიგნიდან.",

  "section.opensource.title": "ღია წყარო",
  "section.opensource.content": "Regex Learn — ეს არის ღია პროექტი, რომელიც მიესალმება ნებისმიერი მსურველის მიერ წვლილის შეტანას და არის სრულიად უფასო. ამ პროექტზე მუშაობა საშუალებას მოგცემთ, გაიუმჯობესოთ უნარები, ისწავლოთ და ითანამშრომლოთ სხვებთან. შეგიძლიათ ხელი შეუწყოთ და მხარში ამოუდგეთ პროექტს.",
  "section.opensource.imageAltText": "ილუსტრაცია ქალბატონისა, ბატონისა და კატისა, რომლებიც თავსატეხის ფრაგმენტებს ერთად უყრიან თავს."
}
